{
   "backend": "tensorflow",
   "class_name": "Sequential",
   "config": {
      "layers": [
         {
            "class_name": "Conv1D",
            "config": {
               "activation": "relu",
               "batch_input_shape": [
                  80,
                  1
               ],
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "filters": 10,
               "kernel_size": [
                  20
               ],
               "name": "conv1d_1",
               "strides": [
                  5
               ]
            }
         },
         {
            "class_name": "Conv1D",
            "config": {
               "activation": "relu",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "filters": 20,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "uniform",
                     "mode": "fan_avg",
                     "scale": 1
                  }
               },
               "kernel_size": [
                  5
               ],
               "name": "conv1d_2",
               "padding": "valid",
               "strides": [
                  1
               ],
               "trainable": true,
               "use_bias": true
            }
         },
         {
            "class_name": "Conv1D",
            "config": {
               "activation": "relu",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "filters": 40,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "uniform",
                     "mode": "fan_avg",
                     "scale": 1
                  }
               },
               "kernel_size": [
                  5
               ],
               "name": "conv1d_3",
               "padding": "valid",
               "strides": [
                  1
               ],
               "trainable": true,
               "use_bias": true
            }
         },
         {
            "class_name": "Flatten",
            "config": {
               "data_format": "channels_last",
               "name": "flatten_1",
               "trainable": true
            }
         },
         {
            "class_name": "Dense",
            "config": {
               "activation": "linear",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "uniform",
                     "mode": "fan_avg",
                     "scale": 1
                  }
               },
               "name": "dense_1",
               "trainable": true,
               "units": 1,
               "use_bias": true
            }
         }
      ],
      "name": "sequential_1"
   },
   "keras_version": "2.2.4"
}